# New York CitiBike

#### Description
The New York CitiBike program is the largest bicycle sharing service in the United States.  Each month, the city makes the raw data of all rides taken in that month available.  This data is available for developers, but the city itself seems to not publish analysis.

Ultimately, this project aims to create visualizations and summaries using the Tableau software package.  However, these individual monthly files are of course large and likely unworkable in Tableau.  Therefore, this notebook is used to perform cleaning operations to produce csv files that can be easily used in Tableau.

Ultimately, the goal is to summarize ride data for the past two years (2017/2018).

#### Load Packages

First, we must load in useful packages such as os and Pandas.

In [86]:
#import packages
import os
import numpy as np
import pandas as pd

#### Save file reference

We will save a reference to the data file.

In [87]:
#create file path
filepath = os.path.join('..', 'data')

#### Explore one file

In the interests of development, we will start with exploring one file, hoping to develop a method (or methods) that summarizes data for a single month.

In [88]:
#get one file
file = os.path.join(filepath, 'JC-201812-citibike-tripdata.csv')

In [89]:
#read in file
test_data = pd.read_csv(file)

In [90]:
#take a look
test_data.head()

,tripduration,starttime,stoptime,start station id,start station name,start station latitude,start station longitude,end station id,end station name,end station latitude,end station longitude,bikeid,usertype,birth year,gender
0,170,2018-12-01 00:03:53.3860,2018-12-01 00:06:43.7160,3183,Exchange Place,40.716247,-74.033459,3214,Essex Light Rail,40.712774,-74.036486,26261,Subscriber,1975,1
1,172,2018-12-01 00:47:13.7340,2018-12-01 00:50:05.8160,3183,Exchange Place,40.716247,-74.033459,3481,York St,40.716490,-74.041050,26175,Subscriber,1988,1
2,247,2018-12-01 00:48:57.6960,2018-12-01 00:53:05.6780,3183,Exchange Place,40.716247,-74.033459,3267,Morris Canal,40.712419,-74.038526,29255,Subscriber,1990,1
3,406,2018-12-01 01:33:53.6630,2018-12-01 01:40:39.7480,3183,Exchange Place,40.716247,-74.033459,3638,Washington St,40.724294,-74.035483,29275,Subscriber,1995,1
4,354,2018-12-01 06:26:52.5120,2018-12-01 06:32:46.5170,3183,Exchange Place,40.716247,-74.033459,3211,Newark Ave,40.721525,-74.046305,29658,Subscriber,1976,1

#### Check formatting of older data

We should also test the oldest file to see if there has been any change in how the files are formatted.

In [91]:
#create file path
old_file = os.path.join(filepath, 'JC-201701-citibike-tripdata.csv')
old_data = pd.read_csv(old_file)
old_data.head()

,Trip Duration,Start Time,Stop Time,Start Station ID,Start Station Name,Start Station Latitude,Start Station Longitude,End Station ID,End Station Name,End Station Latitude,End Station Longitude,Bike ID,User Type,Birth Year,Gender
0,148,2017-01-01 00:21:32,2017-01-01 00:24:01,3276,Marin Light Rail,40.714584,-74.042817,3185,City Hall,40.717733,-74.043845,24575,Subscriber,1983.0,1
1,1283,2017-01-01 00:24:35,2017-01-01 00:45:58,3183,Exchange Place,40.716247,-74.033459,3198,Heights Elevator,40.748716,-74.040443,24723,Subscriber,1978.0,1
2,372,2017-01-01 00:38:19,2017-01-01 00:44:31,3183,Exchange Place,40.716247,-74.033459,3211,Newark Ave,40.721525,-74.046305,24620,Subscriber,1989.0,1
3,1513,2017-01-01 00:38:37,2017-01-01 01:03:50,3194,McGinley Square,40.725340,-74.067622,3271,Danforth Light Rail,40.692640,-74.088012,24668,Subscriber,1961.0,1
4,639,2017-01-01 01:47:52,2017-01-01 01:58:31,3183,Exchange Place,40.716247,-74.033459,3203,Hamilton Park,40.727596,-74.044247,26167,Subscriber,1993.0,1

Looking at this, we see that the main change is that there is now subsecond level data.  This seems to have changed for 2018 data vs. 2017 (by physically looking at files).  As we likely have no need of subsecond precision, we will strip it off if there is a need.

#### Column List
We should also check the column names.

In [92]:
test_data.columns

Index(['tripduration', 'starttime', 'stoptime', 'start station id',
       'start station name', 'start station latitude',
       'start station longitude', 'end station id', 'end station name',
       'end station latitude', 'end station longitude', 'bikeid', 'usertype',
       'birth year', 'gender'],
      dtype='object')

In [93]:
old_data.columns

Index(['Trip Duration', 'Start Time', 'Stop Time', 'Start Station ID',
       'Start Station Name', 'Start Station Latitude',
       'Start Station Longitude', 'End Station ID', 'End Station Name',
       'End Station Latitude', 'End Station Longitude', 'Bike ID', 'User Type',
       'Birth Year', 'Gender'],
      dtype='object')

We see that we have the same columns but slightly different name formatting.  We will assign the names to be the same.

In [94]:
#reassign columns
old_data.columns = test_data.columns
old_data.columns

Index(['tripduration', 'starttime', 'stoptime', 'start station id',
       'start station name', 'start station latitude',
       'start station longitude', 'end station id', 'end station name',
       'end station latitude', 'end station longitude', 'bikeid', 'usertype',
       'birth year', 'gender'],
      dtype='object')

#### Dates and Times

We need to do some string splits to get the dates and times in an easier format.

In [95]:
#get dates
test_data['start_date'] = test_data['starttime'].str.split(' ', expand = True).iloc[:, 0]
test_data['stop_date'] = test_data['stoptime'].str.split(' ', expand = True).iloc[:, 0]

In [96]:
#get times (remove decimal places)
test_data['start_time'] = test_data['starttime'].str.split(' ', expand = True).iloc[:, 1].str.split('.', 
                                                                                            expand = True).iloc[:, 0]
test_data['stop_time'] = test_data['stoptime'].str.split(' ', expand = True).iloc[:, 1].str.split('.', 
                                                                                            expand = True).iloc[:, 0]

In [97]:
#look at result
test_data.head()

,tripduration,starttime,stoptime,start station id,start station name,start station latitude,start station longitude,end station id,end station name,end station latitude,end station longitude,bikeid,usertype,birth year,gender,start_date,stop_date,start_time,stop_time
0,170,2018-12-01 00:03:53.3860,2018-12-01 00:06:43.7160,3183,Exchange Place,40.716247,-74.033459,3214,Essex Light Rail,40.712774,-74.036486,26261,Subscriber,1975,1,2018-12-01,2018-12-01,00:03:53,00:06:43
1,172,2018-12-01 00:47:13.7340,2018-12-01 00:50:05.8160,3183,Exchange Place,40.716247,-74.033459,3481,York St,40.716490,-74.041050,26175,Subscriber,1988,1,2018-12-01,2018-12-01,00:47:13,00:50:05
2,247,2018-12-01 00:48:57.6960,2018-12-01 00:53:05.6780,3183,Exchange Place,40.716247,-74.033459,3267,Morris Canal,40.712419,-74.038526,29255,Subscriber,1990,1,2018-12-01,2018-12-01,00:48:57,00:53:05
3,406,2018-12-01 01:33:53.6630,2018-12-01 01:40:39.7480,3183,Exchange Place,40.716247,-74.033459,3638,Washington St,40.724294,-74.035483,29275,Subscriber,1995,1,2018-12-01,2018-12-01,01:33:53,01:40:39
4,354,2018-12-01 06:26:52.5120,2018-12-01 06:32:46.5170,3183,Exchange Place,40.716247,-74.033459,3211,Newark Ave,40.721525,-74.046305,29658,Subscriber,1976,1,2018-12-01,2018-12-01,06:26:52,06:32:46

#### Station List

One task we have is to extract a list of all stations.  We will attempt this with the most recent data.

We would like counts of the people who leave from each station.

In [98]:
#group by start station id
grouped_by_start = test_data.groupby(['start station id'])

In [99]:
#look at names
start_stations = grouped_by_start['start station name'].first()
start_stations

start station id
3183             Exchange Place
3184                Paulus Hook
3185                  City Hall
3186              Grove St PATH
3187                  Warren St
3191                   Union St
3192         Liberty Light Rail
3193               Lincoln Park
3194            McGinley Square
3195                    Sip Ave
3196             Riverview Park
3198           Heights Elevator
3199               Newport Pkwy
3201                     Dey St
3202               Newport PATH
3203              Hamilton Park
3205          JC Medical Center
3206                    Hilltop
3207                Oakland Ave
3209               Brunswick St
3210             Pershing Field
3211                 Newark Ave
3212            Christ Hospital
3213             Van Vorst Park
3214           Essex Light Rail
3220          5 Corners Library
3225      Baldwin at Montgomery
3267               Morris Canal
3268             Lafayette Park
3269            Brunswick & 6th
3270            Jersey & 6th St
3272               Jersey & 3rd
3273               Manila & 1st
3275             Columbus Drive
3276           Marin Light Rail
3277    Communipaw & Berry Lane
3278           Monmouth and 6th
3279                Dixon Mills
3280                Astor Place
3281        Leonard Gordon Park
3426                 JCBS Depot
3481                    York St
3483              Montgomery St
3638              Washington St
3639                 Harborside
3640             Journal Square
3677               Glenwood Ave
3678              Fairmount Ave
3679                 Bergen Ave
3681                   Grand St
3694             Jackson Square
Name: start station name, dtype: object

In [100]:
#now lets take a look at the counts
start_station_counts = grouped_by_start['start station name'].count()
start_station_counts

start station id
3183     904
3184     355
3185     481
3186    2535
3187     413
3191      56
3192     332
3193     145
3194     357
3195    1199
3196      82
3198     133
3199     454
3201      46
3202     775
3203    1185
3205     305
3206     141
3207     315
3209     480
3210     338
3211     516
3212     102
3213     480
3214     319
3220     116
3225     259
3267     485
3268     111
3269     547
3270     513
3272     464
3273     330
3275     408
3276     541
3277      77
3278     435
3279     398
3280     224
3281     158
3426       4
3481     202
3483     263
3638     383
3639     688
3640     423
3677      69
3678     177
3679     145
3681     285
3694      52
Name: start station name, dtype: int64

It is also useful to look at end station counts, so we will group by that as well and compute counts.

In [101]:
#group by end station id
grouped_by_end = test_data.groupby(['end station id'])

#compute counts
end_station_counts = grouped_by_end['end station name'].count()

#display counts
end_station_counts

end station id
254        1
304        1
459        1
482        2
3002       2
3183    1126
3184     378
3185     574
3186    3187
3187     462
3191      70
3192     366
3193     175
3194     307
3195    1139
3196      74
3198     127
3199     454
3201      82
3202     772
3203    1025
3205     282
3206     108
3207     179
3209     405
3210     298
3211     606
3212      91
3213     404
3214     331
3220      93
3225     235
3267     445
3268     105
3269     435
3270     366
3272     411
3273     448
3275     426
3276     489
3277      65
3278     414
3279     346
3280     223
3281     139
3426       7
3481     192
3483     235
3638     412
3639     701
3640     381
3677      39
3678     126
3679     123
3681     276
3694      44
Name: end station name, dtype: int64

#### Joining Counts

It is to our advantage to combine these counts into one dataframe.  First, we will make individual data frames and then join them.  We will need to set nonoccurring counts to 0.  We also need to fill in latitudes and longitudes.

In [102]:
#save latitudes and longitudes
start_lat = grouped_by_start['start station latitude'].first()
start_lon = grouped_by_start['start station longitude'].first()
end_lat = grouped_by_end['end station latitude'].first()
end_lon = grouped_by_end['end station longitude'].first()

In [103]:
#Create a dataframe with start counts
start_station_df = pd.DataFrame({'start station count': start_station_counts,
                                'latitude': start_lat, 'longitude': start_lon})

#create a dataframe with end counts
end_station_df = pd.DataFrame({'end station count': end_station_counts,
                              'lat': end_lat, 'lon': end_lon})

In [104]:
#reset indices
start_station_df.reset_index(inplace = True)
end_station_df.reset_index(inplace = True)

In [105]:
#rename columns
start_station_df.columns = ['station id', 'start station count', 'latitude', 'longitude']
end_station_df.columns = ['station id', 'end station count', 'lat', 'lon']

In [106]:
#join on station id
stations_df = start_station_df.merge(end_station_df, on = 'station id', how = 'outer')

In [107]:
#fill nans for latitude and longitude
stations_df['latitude'] = stations_df['latitude'].fillna(stations_df['lat'])
stations_df['longitude'] = stations_df['longitude'].fillna(stations_df['lon'])

In [108]:
#drop unnecessary columns
stations_df = stations_df[['station id', 'latitude', 'longitude', 'start station count', 'end station count']]

#show
stations_df.head()

   station id   latitude  longitude  start station count  end station count
0        3183  40.716247 -74.033459                904.0               1126
1        3184  40.714145 -74.033552                355.0                378
2        3185  40.717733 -74.043845                481.0                574
3        3186  40.719586 -74.043117               2535.0               3187
4        3187  40.721124 -74.038051                413.0                462

#### Summary of subscriber types, age, user type, trip duration

We want to create a monthly summary of various variables like user type (24-hour or 3-day pass), gender, trip duration (minutes), and user age

In [109]:
#trip duration
#convert trip duration to minutes for ease of use
test_data['duration_min'] = test_data['tripduration']/60

#describe it
duration_description = test_data['duration_min'].describe()

duration_description

count    20205.000000
mean         9.350120
std        103.255582
min          1.016667
25%          3.533333
50%          5.066667
75%          7.933333
max       8938.483333
Name: duration_min, dtype: float64

In [110]:
#age
#calculate estimated age as year - birthyear
test_data['age'] = 2018 - test_data['birth year']

#describe it
age_description = test_data['age'].describe()

age_description

count    20205.000000
mean        36.625637
std         10.089665
min         16.000000
25%         29.000000
50%         34.000000
75%         42.000000
max         77.000000
Name: age, dtype: float64

In [111]:
#gender
#get value counts (0 for unknown, 1 for male, 2 for female)
gender_counts = test_data['gender'].value_counts()

gender_counts

1    15161
2     4325
0      719
Name: gender, dtype: int64

In [112]:
#user type
#get value counts (subscribers are annual pass holders, customers hold 24-hour passes or 3-day passes)
user_counts = test_data['usertype'].value_counts()

user_counts

Subscriber    19614
Customer        591
Name: usertype, dtype: int64

We now have all we need to make a dataframe.  However, we obviously only need some values (for instance we don't need the total count twice).  Also, the minimum and maximum trip durations seem somewhat flukey (problems starting or forgetting to return bike), so we will ignore them.

In [113]:
#create a monthly summary dataframe
summary_df = pd.DataFrame({'Month': ['2018-12'], 'Number of Rides': [duration_description['count']],
                          'Mean Duration': [duration_description['mean']], '1Q Duration': [duration_description['25%']],
                          '3Q Duration': [duration_description['75%']], 'Median Duration': [duration_description['50%']],
                          'Mean Age': [age_description['mean']], 'StdDev Age': [age_description['std']],
                          'Min Age': [age_description['min']], 'Max Age': [age_description['max']],
                          '1Q Age': [age_description['25%']], '3Q Age': [age_description['75%']],
                          'Median Age': [age_description['50%']], 'Unknown Gender Users': [gender_counts[0]],
                          'Male Users': [gender_counts[1]], 'Female Users': [gender_counts[2]],
                          'Short-Term Pass Uses': [user_counts['Customer']], 
                           'Annual Pass Uses': [user_counts['Subscriber']]})

In [114]:
#look at dataframe
summary_df

,Month,Number of Rides,Mean Duration,1Q Duration,3Q Duration,Median Duration,Mean Age,StdDev Age,Min Age,Max Age,1Q Age,3Q Age,Median Age,Unknown Gender Users,Male Users,Female Users,Short-Term Pass Uses,Annual Pass Uses
0,2018-12,20205.0,9.35012,3.533333,7.933333,5.066667,36.625637,10.089665,16.0,77.0,29.0,42.0,34.0,719,15161,4325,591,19614

#### Starting Hour of the Day
We would like to know what time of day people typically use the bikes.

To do so, we will strip out the hour and group by it.

In [115]:
#calculate hour
test_data['hour'] = test_data['start_time'].str.split(':', expand = True).iloc[:, 0]

In [116]:
#group by hour
grouped_by_hour = test_data.groupby('hour')

In [117]:
#get counts
hour_counts = grouped_by_hour['start_time'].count()

In [118]:
#create dataframe
hour_df = pd.DataFrame(hour_counts)

In [119]:
#reset index
hour_df.reset_index(inplace = True)

In [120]:
#rename columns and show
hour_df.columns = ['Hour', 'Count']

#make an integer
hour_df['Hour'] = pd.to_numeric(hour_df['Hour'])

hour_df.head()

   Hour  Count
0     0    178
1     1    109
2     2     56
3     3     35
4     4     69

#### Functions

We have a number of months to go through, so we would like to build functions that can read a file and return a dataframe, so that we can then aggregate results with list comprehension and pandas aggregation functions.

In [121]:
#function to summarize station start and end counts for a specific year and month
def station_counts(year, month):
    
    #create file path
    filepath = os.path.join('..', 'data')
    
    #get one file
    file = os.path.join(filepath, f'JC-{year}{month}-citibike-tripdata.csv')
    
    #read in data
    data = pd.read_csv(file)
    
    #set column names
    data.columns = ['tripduration', 'starttime', 'stoptime', 'start station id',
       'start station name', 'start station latitude',
       'start station longitude', 'end station id', 'end station name',
       'end station latitude', 'end station longitude', 'bikeid', 'usertype',
       'birth year', 'gender']
    
    #group by start station id
    grouped_by_start = data.groupby(['start station id'])
    
    #group by end station id
    grouped_by_end = data.groupby(['end station id'])
    
    #create a start station dataframe
    start_station_df = pd.DataFrame({'start station count': grouped_by_start['start station name'].count(),
                            'station name': grouped_by_start['start station name'].first(),
                            'latitude': grouped_by_start['start station latitude'].first(),
                            'longitude': grouped_by_start['start station longitude'].first()})
    
    #create an end station dataframe
    end_station_df = pd.DataFrame({'end station count': grouped_by_end['end station name'].count(),
                          'name': grouped_by_end['end station name'].first(),
                          'lat': grouped_by_end['end station latitude'].first(),
                          'lon': grouped_by_end['end station longitude'].first()})
    
    #reset indices
    start_station_df.reset_index(inplace = True)
    end_station_df.reset_index(inplace = True)
    
    #rename columns
    start_station_df.columns = ['station id', 'start station count', 'station name', 'latitude', 'longitude']
    end_station_df.columns = ['station id', 'end station count', 'name', 'lat', 'lon']
    
    #join on station id
    stations_df = start_station_df.merge(end_station_df, on = 'station id', how = 'outer')
    
    #fill nans for latitude and longitude
    stations_df['latitude'] = stations_df['latitude'].fillna(stations_df['lat'])
    stations_df['longitude'] = stations_df['longitude'].fillna(stations_df['lon'])
    
    #fill nans for station name
    stations_df['station name'] = stations_df['station name'].fillna(stations_df['name'])
    
    #drop unnecessary columns
    stations_df = stations_df[['station id', 'latitude', 'longitude', 'start station count', 'end station count']]
    
    #fill nans (counts) with 0
    stations_df = stations_df.fillna(0)
    
    #add month in for column
    stations_df['month'] = f"{year}-{month}"
    
    #return dataframe
    return stations_df

In [122]:
#test function
station_counts(2018, 12).head()

,station id,latitude,longitude,start station count,end station count,month
0,3183,40.716247,-74.033459,904.0,1126,2018-12
1,3184,40.714145,-74.033552,355.0,378,2018-12
2,3185,40.717733,-74.043845,481.0,574,2018-12
3,3186,40.719586,-74.043117,2535.0,3187,2018-12
4,3187,40.721124,-74.038051,413.0,462,2018-12

In [131]:
#function to summarize age, gender, user type, and trip duration
def month_summary(year, month):
    
    #create file path
    filepath = os.path.join('..', 'data')
    
    #get one file
    file = os.path.join(filepath, f'JC-{year}{month}-citibike-tripdata.csv')
    
    #read in data
    data = pd.read_csv(file)
    
    #set column names
    data.columns = ['tripduration', 'starttime', 'stoptime', 'start station id',
       'start station name', 'start station latitude',
       'start station longitude', 'end station id', 'end station name',
       'end station latitude', 'end station longitude', 'bikeid', 'usertype',
       'birth year', 'gender']
    
    #trip duration
    #convert trip duration to minutes for ease of use
    data['duration_min'] = data['tripduration']/60

    #describe it
    duration_description = data['duration_min'].describe()
    
    #age
    #calculate estimated age as year - birthyear
    data['age'] = int(year) - pd.to_numeric(data['birth year'])

    #describe it
    age_description = data['age'].describe()
    
    #gender
    #get value counts (0 for unknown, 1 for male, 2 for female)
    gender_counts = data['gender'].value_counts()
    
    #user type
    #get value counts (subscribers are annual pass holders, customers hold 24-hour passes or 3-day passes)
    user_counts = data['usertype'].value_counts()
    
    #create a monthly summary dataframe
    summary_df = pd.DataFrame({'Month': [f"{year}-{month}"], 'Number of Rides': [duration_description['count']],
                              'Mean Duration': [duration_description['mean']], 
                               '1Q Duration': [duration_description['25%']],
                              '3Q Duration': [duration_description['75%']], 
                               'Median Duration': [duration_description['50%']],
                              'Mean Age': [age_description['mean']], 'StdDev Age': [age_description['std']],
                              'Min Age': [age_description['min']], 'Max Age': [age_description['max']],
                              '1Q Age': [age_description['25%']], '3Q Age': [age_description['75%']],
                              'Median Age': [age_description['50%']], 'Unknown Gender Users': [gender_counts[0]],
                              'Male Users': [gender_counts[1]], 'Female Users': [gender_counts[2]],
                              'Short-Term Pass Uses': [user_counts['Customer']], 
                               'Annual Pass Uses': [user_counts['Subscriber']]})
    
    #return summary_df
    return summary_df

In [132]:
#test
month_summary(2018, 12)

,Month,Number of Rides,Mean Duration,1Q Duration,3Q Duration,Median Duration,Mean Age,StdDev Age,Min Age,Max Age,1Q Age,3Q Age,Median Age,Unknown Gender Users,Male Users,Female Users,Short-Term Pass Uses,Annual Pass Uses
0,2018-12,20205.0,9.35012,3.533333,7.933333,5.066667,36.625637,10.089665,16.0,77.0,29.0,42.0,34.0,719,15161,4325,591,19614

In [133]:
#function to summarize hourly distributions for a month
def hour_counts(year, month):
    
    #create file path
    filepath = os.path.join('..', 'data')
    
    #get one file
    file = os.path.join(filepath, f'JC-{year}{month}-citibike-tripdata.csv')
    
    #read in data
    data = pd.read_csv(file)
    
    #set column names
    data.columns = ['tripduration', 'starttime', 'stoptime', 'start station id',
       'start station name', 'start station latitude',
       'start station longitude', 'end station id', 'end station name',
       'end station latitude', 'end station longitude', 'bikeid', 'usertype',
       'birth year', 'gender']
    
    #calculate start time
    data['start_time'] = data['starttime'].str.split(' ', expand = True).iloc[:, 1].str.split('.', 
                                                                                              expand = True).iloc[:, 0]
    #calculate hour
    data['hour'] = data['start_time'].str.split(':', expand = True).iloc[:, 0]
    
    #group by hour
    grouped_by_hour = data.groupby('hour')
    
    #get counts
    hour_counts = grouped_by_hour['start_time'].count()
    
    #create dataframe
    hour_df = pd.DataFrame(hour_counts)
    
    #reset index
    hour_df.reset_index(inplace = True)
    
    #rename columns and show
    hour_df.columns = ['Hour', 'Count']

    #make hour an integer
    hour_df['Hour'] = pd.to_numeric(hour_df['Hour'])
    
    #add month as a column
    hour_df['Month'] = f"{year}-{month}"
    
    #return dataframe
    return hour_df

In [134]:
#test function
hour_counts(2018, 12)

    Hour  Count    Month
0      0    178  2018-12
1      1    109  2018-12
2      2     56  2018-12
3      3     35  2018-12
4      4     69  2018-12
5      5    210  2018-12
6      6    578  2018-12
7      7   1361  2018-12
8      8   2541  2018-12
9      9   1375  2018-12
10    10    850  2018-12
11    11    850  2018-12
12    12    955  2018-12
13    13    952  2018-12
14    14    856  2018-12
15    15    905  2018-12
16    16   1020  2018-12
17    17   1769  2018-12
18    18   1939  2018-12
19    19   1378  2018-12
20    20    874  2018-12
21    21    636  2018-12
22    22    459  2018-12
23    23    250  2018-12

#### Combining Data

We now wish to combine all the data for all 24 months into combined dataframes so that they may be saved as csv files that can be easily read by the Tableau software.

First, we will do the station counts.  To do so, we will need a list of dataframes for each month.  We will do this via list comprehension.  Therefore, we first create lists of months and years to iterate over.

In [135]:
#months and years
months = ['01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12']
years = ['2017', '2018']

Now, we can perform the list comprehension.

In [136]:
#get counts
all_station_counts = [station_counts(year, month) for year in years for month in months]

Next, we will combine this list of dataframes into one using Panda's concatenate function.

In [137]:
#concatenate the data frames 
#(ignore_index set to True so each entry has a separate index 0 to n-1 with n being total length)
all_stations_df = pd.concat(all_station_counts, ignore_index = True)
all_stations_df.head()

,station id,latitude,longitude,start station count,end station count,month
0,3183,40.716247,-74.033459,946.0,1065.0,2017-01
1,3184,40.714145,-74.033552,299.0,359.0,2017-01
2,3185,40.717733,-74.043845,427.0,478.0,2017-01
3,3186,40.719586,-74.043117,1638.0,2243.0,2017-01
4,3187,40.721124,-74.038051,332.0,362.0,2017-01

Now that we have completed the concatenation for the station counts, we can proceed to the monthly summaries.

We will do the same procedure.

In [138]:
#list comprehension to perform function for all months
all_monthly_summaries = [month_summary(year, month) for year in years for month in months]

In [139]:
#concatenate the data frames
all_summaries_df = pd.concat(all_monthly_summaries, ignore_index = True)
all_summaries_df.head()

,Month,Number of Rides,Mean Duration,1Q Duration,3Q Duration,Median Duration,Mean Age,StdDev Age,Min Age,Max Age,1Q Age,3Q Age,Median Age,Unknown Gender Users,Male Users,Female Users,Short-Term Pass Uses,Annual Pass Uses
0,2017-01,12926.0,9.629513,3.683333,8.366667,5.166667,37.884211,10.033105,18.0,86.0,31.0,43.0,36.0,443,10016,2467,81,12827
1,2017-02,14026.0,10.163136,3.633333,8.916667,5.233333,37.971312,10.223980,18.0,86.0,31.0,43.0,36.0,893,10422,2711,456,13504
2,2017-03,12201.0,11.239260,3.616667,8.266667,5.133333,37.656835,10.206045,18.0,86.0,30.0,42.0,35.0,567,9195,2439,193,11975
3,2017-04,21186.0,15.348559,3.950000,11.133333,6.116667,37.286004,10.151177,16.0,117.0,30.0,42.0,35.0,2072,15093,4021,1829,19357
4,2017-05,25966.0,16.342461,3.933333,10.416667,5.983333,37.193481,10.024300,19.0,86.0,30.0,42.0,35.0,2035,18611,5320,1641,24325

We now proceed to the hour counts.

In [140]:
#list comprehension for all months
all_hour_counts = [hour_counts(year, month) for year in years for month in months]

In [141]:
#concatenate the data frames
all_hour_df = pd.concat(all_hour_counts, ignore_index = True)
all_hour_df.head()

   Hour  Count    Month
0     0    106  2017-01
1     1     47  2017-01
2     2     34  2017-01
3     3     18  2017-01
4     4     51  2017-01

#### Writing

Now, we write to new files in the processed data folder.

In [142]:
#save folder path
writing_folder = os.path.join('..', 'processed data')

In [143]:
#save filepaths
station_path = os.path.join(writing_folder, 'station counts.csv')
summary_path = os.path.join(writing_folder, 'monthly summaries.csv')
hours_path = os.path.join(writing_folder, 'hour counts.csv')

In [144]:
#write stations file
all_stations_df.to_csv(station_path, index = False)

In [145]:
#write summaries file
all_summaries_df.to_csv(summary_path, index = False)

In [146]:
#write hours file
all_hour_df.to_csv(hours_path, index = False)

#### Full Summary

We will now create a full summary of data like age, as some things seem to be constant month to month.

To do this we must combine all data files.

In [147]:
#create filepaths
filepaths = [f"../data/JC-{year}{month}-citibike-tripdata.csv" for year in years for month in months]

In [148]:
#read in data
all_data = [pd.read_csv(filepath) for filepath in filepaths]

In [149]:
#rename columns
for data in all_data:
        data.columns = ['tripduration', 'starttime', 'stoptime', 'start station id',
       'start station name', 'start station latitude',
       'start station longitude', 'end station id', 'end station name',
       'end station latitude', 'end station longitude', 'bikeid', 'usertype',
       'birth year', 'gender']

In [150]:
#concatenate
all_data_df = pd.concat(all_data, ignore_index = True)

In [151]:
#observe
all_data_df.head()

,tripduration,starttime,stoptime,start station id,start station name,start station latitude,start station longitude,end station id,end station name,end station latitude,end station longitude,bikeid,usertype,birth year,gender
0,148,2017-01-01 00:21:32,2017-01-01 00:24:01,3276,Marin Light Rail,40.714584,-74.042817,3185,City Hall,40.717733,-74.043845,24575,Subscriber,1983.0,1
1,1283,2017-01-01 00:24:35,2017-01-01 00:45:58,3183,Exchange Place,40.716247,-74.033459,3198,Heights Elevator,40.748716,-74.040443,24723,Subscriber,1978.0,1
2,372,2017-01-01 00:38:19,2017-01-01 00:44:31,3183,Exchange Place,40.716247,-74.033459,3211,Newark Ave,40.721525,-74.046305,24620,Subscriber,1989.0,1
3,1513,2017-01-01 00:38:37,2017-01-01 01:03:50,3194,McGinley Square,40.725340,-74.067622,3271,Danforth Light Rail,40.692640,-74.088012,24668,Subscriber,1961.0,1
4,639,2017-01-01 01:47:52,2017-01-01 01:58:31,3183,Exchange Place,40.716247,-74.033459,3203,Hamilton Park,40.727596,-74.044247,26167,Subscriber,1993.0,1

Now, we can prepare a summary of the data as in the monthly summaries above.

In [152]:
#trip duration
#convert trip duration to minutes for ease of use
all_data_df['duration_min'] = all_data_df['tripduration']/60

#describe it
duration_description = all_data_df['duration_min'].describe()
    
#age
#calculate start_date
all_data_df['start_date'] = all_data_df['starttime'].str.split(' ', expand = True).iloc[:, 0]
all_data_df['year'] = all_data_df['start_date'].str.split('-', expand = True).iloc[:, 0]

#calculate estimated age as year - birthyear
all_data_df['age'] = pd.to_numeric(all_data_df['year']) - all_data_df['birth year']

#describe it
age_description = all_data_df['age'].describe()
    
#gender
#get value counts (0 for unknown, 1 for male, 2 for female)
gender_counts = all_data_df['gender'].value_counts()
    
#user type
#get value counts (subscribers are annual pass holders, customers hold 24-hour passes or 3-day passes)
user_counts = all_data_df['usertype'].value_counts()
    
#create a monthly summary dataframe
summary_df = pd.DataFrame({'Number of Rides': [duration_description['count']],
                            'Mean Duration': [duration_description['mean']], 
                            '1Q Duration': [duration_description['25%']],
                            '3Q Duration': [duration_description['75%']], 
                            'Median Duration': [duration_description['50%']],
                            'Mean Age': [age_description['mean']], 'StdDev Age': [age_description['std']],
                            'Min Age': [age_description['min']], 'Max Age': [age_description['max']],
                            '1Q Age': [age_description['25%']], '3Q Age': [age_description['75%']],
                            'Median Age': [age_description['50%']], 'Unknown Gender Users': [gender_counts[0]],
                            'Male Users': [gender_counts[1]], 'Female Users': [gender_counts[2]],
                            'Short-Term Pass Uses': [user_counts['Customer']], 
                            'Annual Pass Uses': [user_counts['Subscriber']]})

In [153]:
#observe
summary_df

,Number of Rides,Mean Duration,1Q Duration,3Q Duration,Median Duration,Mean Age,StdDev Age,Min Age,Max Age,1Q Age,3Q Age,Median Age,Unknown Gender Users,Male Users,Female Users,Short-Term Pass Uses,Annual Pass Uses
0,648820.0,11.725299,3.85,9.45,5.65,37.378068,10.230686,16.0,131.0,30.0,43.0,35.0,42341,469840,136639,38197,610506

In [154]:
#write file
summary_df.to_csv('../processed data/full_summary.csv', index = False)